Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.3.61/samv70b/include/component/pio.h
/* -------- PIO_PPDSR : (PIO Offset: 0x98) ( R/ 32) Pad Pull-down Status Register -------- */
#define PIO_PPDSR_P0_Pos                      _U_(0)                                               /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P0_Msk                      (_U_(0x1) << PIO_PPDSR_P0_Pos)                       /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P0(value)                   (PIO_PPDSR_P0_Msk & ((value) << PIO_PPDSR_P0_Pos))  
#define PIO_PPDSR_P1_Pos                      _U_(1)                                               /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P1_Msk                      (_U_(0x1) << PIO_PPDSR_P1_Pos)                       /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P1(value)                   (PIO_PPDSR_P1_Msk & ((value) << PIO_PPDSR_P1_Pos))  
#define PIO_PPDSR_P2_Pos                      _U_(2)                                               /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P2_Msk                      (_U_(0x1) << PIO_PPDSR_P2_Pos)                       /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P2(value)                   (PIO_PPDSR_P2_Msk & ((value) << PIO_PPDSR_P2_Pos))  
#define PIO_PPDSR_P3_Pos                      _U_(3)                                               /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P3_Msk                      (_U_(0x1) << PIO_PPDSR_P3_Pos)                       /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P3(value)                   (PIO_PPDSR_P3_Msk & ((value) << PIO_PPDSR_P3_Pos))  
#define PIO_PPDSR_P4_Pos                      _U_(4)                                               /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P4_Msk                      (_U_(0x1) << PIO_PPDSR_P4_Pos)                       /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P4(value)                   (PIO_PPDSR_P4_Msk & ((value) << PIO_PPDSR_P4_Pos))  
#define PIO_PPDSR_P5_Pos                      _U_(5)                                               /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P5_Msk                      (_U_(0x1) << PIO_PPDSR_P5_Pos)                       /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P5(value)                   (PIO_PPDSR_P5_Msk & ((value) << PIO_PPDSR_P5_Pos))  
#define PIO_PPDSR_P6_Pos                      _U_(6)                                               /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P6_Msk                      (_U_(0x1) << PIO_PPDSR_P6_Pos)                       /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P6(value)                   (PIO_PPDSR_P6_Msk & ((value) << PIO_PPDSR_P6_Pos))  
#define PIO_PPDSR_P7_Pos                      _U_(7)                                               /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P7_Msk                      (_U_(0x1) << PIO_PPDSR_P7_Pos)                       /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P7(value)                   (PIO_PPDSR_P7_Msk & ((value) << PIO_PPDSR_P7_Pos))  
#define PIO_PPDSR_P8_Pos                      _U_(8)                                               /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P8_Msk                      (_U_(0x1) << PIO_PPDSR_P8_Pos)                       /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P8(value)                   (PIO_PPDSR_P8_Msk & ((value) << PIO_PPDSR_P8_Pos))  
#define PIO_PPDSR_P9_Pos                      _U_(9)                                               /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P9_Msk                      (_U_(0x1) << PIO_PPDSR_P9_Pos)                       /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P9(value)                   (PIO_PPDSR_P9_Msk & ((value) << PIO_PPDSR_P9_Pos))  
#define PIO_PPDSR_P10_Pos                     _U_(10)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P10_Msk                     (_U_(0x1) << PIO_PPDSR_P10_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P10(value)                  (PIO_PPDSR_P10_Msk & ((value) << PIO_PPDSR_P10_Pos))
#define PIO_PPDSR_P11_Pos                     _U_(11)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P11_Msk                     (_U_(0x1) << PIO_PPDSR_P11_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P11(value)                  (PIO_PPDSR_P11_Msk & ((value) << PIO_PPDSR_P11_Pos))
#define PIO_PPDSR_P12_Pos                     _U_(12)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P12_Msk                     (_U_(0x1) << PIO_PPDSR_P12_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P12(value)                  (PIO_PPDSR_P12_Msk & ((value) << PIO_PPDSR_P12_Pos))
#define PIO_PPDSR_P13_Pos                     _U_(13)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P13_Msk                     (_U_(0x1) << PIO_PPDSR_P13_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P13(value)                  (PIO_PPDSR_P13_Msk & ((value) << PIO_PPDSR_P13_Pos))
#define PIO_PPDSR_P14_Pos                     _U_(14)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P14_Msk                     (_U_(0x1) << PIO_PPDSR_P14_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P14(value)                  (PIO_PPDSR_P14_Msk & ((value) << PIO_PPDSR_P14_Pos))
#define PIO_PPDSR_P15_Pos                     _U_(15)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P15_Msk                     (_U_(0x1) << PIO_PPDSR_P15_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P15(value)                  (PIO_PPDSR_P15_Msk & ((value) << PIO_PPDSR_P15_Pos))
#define PIO_PPDSR_P16_Pos                     _U_(16)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P16_Msk                     (_U_(0x1) << PIO_PPDSR_P16_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P16(value)                  (PIO_PPDSR_P16_Msk & ((value) << PIO_PPDSR_P16_Pos))
#define PIO_PPDSR_P17_Pos                     _U_(17)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P17_Msk                     (_U_(0x1) << PIO_PPDSR_P17_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P17(value)                  (PIO_PPDSR_P17_Msk & ((value) << PIO_PPDSR_P17_Pos))
#define PIO_PPDSR_P18_Pos                     _U_(18)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P18_Msk                     (_U_(0x1) << PIO_PPDSR_P18_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P18(value)                  (PIO_PPDSR_P18_Msk & ((value) << PIO_PPDSR_P18_Pos))
#define PIO_PPDSR_P19_Pos                     _U_(19)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P19_Msk                     (_U_(0x1) << PIO_PPDSR_P19_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P19(value)                  (PIO_PPDSR_P19_Msk & ((value) << PIO_PPDSR_P19_Pos))
#define PIO_PPDSR_P20_Pos                     _U_(20)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P20_Msk                     (_U_(0x1) << PIO_PPDSR_P20_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P20(value)                  (PIO_PPDSR_P20_Msk & ((value) << PIO_PPDSR_P20_Pos))
#define PIO_PPDSR_P21_Pos                     _U_(21)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P21_Msk                     (_U_(0x1) << PIO_PPDSR_P21_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P21(value)                  (PIO_PPDSR_P21_Msk & ((value) << PIO_PPDSR_P21_Pos))
#define PIO_PPDSR_P22_Pos                     _U_(22)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P22_Msk                     (_U_(0x1) << PIO_PPDSR_P22_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P22(value)                  (PIO_PPDSR_P22_Msk & ((value) << PIO_PPDSR_P22_Pos))
#define PIO_PPDSR_P23_Pos                     _U_(23)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P23_Msk                     (_U_(0x1) << PIO_PPDSR_P23_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P23(value)                  (PIO_PPDSR_P23_Msk & ((value) << PIO_PPDSR_P23_Pos))
#define PIO_PPDSR_P24_Pos                     _U_(24)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P24_Msk                     (_U_(0x1) << PIO_PPDSR_P24_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P24(value)                  (PIO_PPDSR_P24_Msk & ((value) << PIO_PPDSR_P24_Pos))
#define PIO_PPDSR_P25_Pos                     _U_(25)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P25_Msk                     (_U_(0x1) << PIO_PPDSR_P25_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P25(value)                  (PIO_PPDSR_P25_Msk & ((value) << PIO_PPDSR_P25_Pos))
#define PIO_PPDSR_P26_Pos                     _U_(26)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P26_Msk                     (_U_(0x1) << PIO_PPDSR_P26_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P26(value)                  (PIO_PPDSR_P26_Msk & ((value) << PIO_PPDSR_P26_Pos))
#define PIO_PPDSR_P27_Pos                     _U_(27)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P27_Msk                     (_U_(0x1) << PIO_PPDSR_P27_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P27(value)                  (PIO_PPDSR_P27_Msk & ((value) << PIO_PPDSR_P27_Pos))
#define PIO_PPDSR_P28_Pos                     _U_(28)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P28_Msk                     (_U_(0x1) << PIO_PPDSR_P28_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P28(value)                  (PIO_PPDSR_P28_Msk & ((value) << PIO_PPDSR_P28_Pos))
#define PIO_PPDSR_P29_Pos                     _U_(29)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P29_Msk                     (_U_(0x1) << PIO_PPDSR_P29_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P29(value)                  (PIO_PPDSR_P29_Msk & ((value) << PIO_PPDSR_P29_Pos))
#define PIO_PPDSR_P30_Pos                     _U_(30)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P30_Msk                     (_U_(0x1) << PIO_PPDSR_P30_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P30(value)                  (PIO_PPDSR_P30_Msk & ((value) << PIO_PPDSR_P30_Pos))
#define PIO_PPDSR_P31_Pos                     _U_(31)                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P31_Msk                     (_U_(0x1) << PIO_PPDSR_P31_Pos)                      /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P31(value)                  (PIO_PPDSR_P31_Msk & ((value) << PIO_PPDSR_P31_Pos))
#define PIO_PPDSR_Msk                         _U_(0xFFFFFFFF)                                      /**< (PIO_PPDSR) Register Mask  */

#define PIO_PPDSR_P_Pos                       _U_(0)                                               /**< (PIO_PPDSR Position) Pull-Down Status */
#define PIO_PPDSR_P_Msk                       (_U_(0xFFFFFFFF) << PIO_PPDSR_P_Pos)                 /**< (PIO_PPDSR Mask) P */
#define PIO_PPDSR_P(value)                    (PIO_PPDSR_P_Msk & ((value) << PIO_PPDSR_P_Pos))     

